{"keras_version": "2.0.1", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "batch_input_shape": [null, 784], "dtype": "float32", "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 1000, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 500, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 10, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_3"}}], "backend": "tensorflow"}