{"class_name": "Sequential", "keras_version": "2.0.1", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 784], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "use_bias": true, "units": 500, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "trainable": true, "bias_regularizer": null, "units": 500, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "trainable": true, "bias_regularizer": null, "units": 10, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_3"}}], "backend": "tensorflow"}